gdgly/powerPack/libraries/boot_rom/f28004x/revA/rom_sources/F28004x_ROM/driverlib/dma.h
//###########################################################################
//
// FILE:   dma.h
//
// TITLE:  C28x DMA driver.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//###########################################################################

#ifndef __DMA_H__
#define __DMA_H__

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup dma_api
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_dma.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"
#include "interrupt.h"

//*****************************************************************************
//
// Values that can be passed to DMA_configMode() as the config parameter.
//
//*****************************************************************************
//! Only one burst transfer performed per trigger.
#define DMA_CFG_ONESHOT_DISABLE     0U
//! Burst transfers occur without additional event triggers after the first.
#define DMA_CFG_ONESHOT_ENABLE      DMA_MODE_ONESHOT

//! DMA channel will be disabled at the end of a transfer.
#define DMA_CFG_CONTINUOUS_DISABLE  0U
//! DMA reinitializes when the transfer count is zero and waits for a trigger.
#define DMA_CFG_CONTINUOUS_ENABLE   DMA_MODE_CONTINUOUS

//! DMA transfers 16 bits at a time.
#define DMA_CFG_SIZE_16BIT          0U
//! DMA transfers 32 bits at a time.
#define DMA_CFG_SIZE_32BIT          DMA_MODE_DATASIZE

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as the \e trigger parameter.
//
//*****************************************************************************
typedef enum
{
    DMA_TRIGGER_SOFTWARE   = 0,

    DMA_TRIGGER_ADCA1      = 1,
    DMA_TRIGGER_ADCA2      = 2,
    DMA_TRIGGER_ADCA3      = 3,
    DMA_TRIGGER_ADCA4      = 4,
    DMA_TRIGGER_ADCAEVT    = 5,
    DMA_TRIGGER_ADCB1      = 6,
    DMA_TRIGGER_ADCB2      = 7,
    DMA_TRIGGER_ADCB3      = 8,
    DMA_TRIGGER_ADCB4      = 9,
    DMA_TRIGGER_ADCBEVT    = 10,
    DMA_TRIGGER_ADCC1      = 11,
    DMA_TRIGGER_ADCC2      = 12,
    DMA_TRIGGER_ADCC3      = 13,
    DMA_TRIGGER_ADCC4      = 14,
    DMA_TRIGGER_ADCCEVT    = 15,

    DMA_TRIGGER_XINT1      = 29,
    DMA_TRIGGER_XINT2      = 30,
    DMA_TRIGGER_XINT3      = 31,
    DMA_TRIGGER_XINT4      = 32,
    DMA_TRIGGER_XINT5      = 33,

    DMA_TRIGGER_EPWM1SOCA  = 36,
    DMA_TRIGGER_EPWM1SOCB  = 37,
    DMA_TRIGGER_EPWM2SOCA  = 38,
    DMA_TRIGGER_EPWM2SOCB  = 39,
    DMA_TRIGGER_EPWM3SOCA  = 40,
    DMA_TRIGGER_EPWM3SOCB  = 41,
    DMA_TRIGGER_EPWM4SOCA  = 42,
    DMA_TRIGGER_EPWM4SOCB  = 43,
    DMA_TRIGGER_EPWM5SOCA  = 44,
    DMA_TRIGGER_EPWM5SOCB  = 45,
    DMA_TRIGGER_EPWM6SOCA  = 46,
    DMA_TRIGGER_EPWM6SOCB  = 47,
    DMA_TRIGGER_EPWM7SOCA  = 48,
    DMA_TRIGGER_EPWM7SOCB  = 49,
    DMA_TRIGGER_EPWM8SOCA  = 50,
    DMA_TRIGGER_EPWM8SOCB  = 51,

    DMA_TRIGGER_TINT0      = 68,
    DMA_TRIGGER_TINT1      = 69,
    DMA_TRIGGER_TINT2      = 70,

    DMA_TRIGGER_ECAP1      = 75,
    DMA_TRIGGER_ECAP2      = 76,
    DMA_TRIGGER_ECAP3      = 77,
    DMA_TRIGGER_ECAP4      = 78,
    DMA_TRIGGER_ECAP5      = 79,
    DMA_TRIGGER_ECAP6      = 80,
    DMA_TRIGGER_ECAP7      = 81,

    DMA_TRIGGER_SDFM1FLT1  = 96,
    DMA_TRIGGER_SDFM1FLT2  = 97,
    DMA_TRIGGER_SDFM1FLT3  = 98,
    DMA_TRIGGER_SDFM1FLT4  = 99,

    DMA_TRIGGER_SPITXA     = 109,
    DMA_TRIGGER_SPIRXA     = 110,
    DMA_TRIGGER_SPITXB     = 111,
    DMA_TRIGGER_SPIRXB     = 112,

    DMA_TRIGGER_LINATX     = 117,
    DMA_TRIGGER_LINARX     = 118,

    DMA_TRIGGER_FSITXA     = 123,
    DMA_TRIGGER_FSIRXA     = 125,

    DMA_TRIGGER_CLB1INT    = 127,
    DMA_TRIGGER_CLB2INT    = 128,
    DMA_TRIGGER_CLB3INT    = 129,
    DMA_TRIGGER_CLB4INT    = 130,

    DMA_TRIGGER_CANAIF1    = 167,
    DMA_TRIGGER_CANAIF2    = 168,
    DMA_TRIGGER_CANAIF3    = 169,
    DMA_TRIGGER_CANBIF1    = 170,
    DMA_TRIGGER_CANBIF2    = 171,
    DMA_TRIGGER_CANBIF3    = 172
} DMA_Trigger;

//*****************************************************************************
//
//! Values that can be passed to DMA_setEmulationMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Transmission stops after current read-write access is completed
    DMA_EMULATION_STOP,
    //! Continue DMA operation regardless of emulation suspend
    DMA_EMULATION_FREE_RUN
} DMA_EmulationMode;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an DMA channel base address.
//!
//! \param base specifies the DMA channel base address.
//!
//! This function determines if a DMA channel base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
DMA_isBaseValid(uint32_t base)
{
    return((base == DMA_CH1_BASE) || (base == DMA_CH2_BASE) ||
           (base == DMA_CH3_BASE) || (base == DMA_CH4_BASE) ||
           (base == DMA_CH5_BASE) || (base == DMA_CH6_BASE));
}
#endif

//*****************************************************************************
//
//! Initializes the DMA controller to a known state.
//!
//! This function configures does a hard reset of the DMA controller in order
//! to put it into a known state. The function also sets the DMA to run free
//! during an emulation suspend (see the field DEBUGCTRL.FREE for more info).
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_initController(void)
{
    EALLOW;

